app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Lorem ipsum"], ["created_at", Thu, 24 Apr 2014 04:42:05 UTC +00:00], ["updated_at", Thu, 24 Apr 2014 04:42:05 UTC +00:00], ["user_id", 1]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save