app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "New Name"], ["email", "new@example.com"], ["password_digest", "$2a$04$Tc0te2pot/FXvuFFG0o.c.S8KxQktverTNV4zEQcigTzz3/lpCNNC"], ["updated_at", Thu, 24 Apr 2014 04:42:08 UTC +00:00]]
---
  def update
    if @user.update_attributes(user_params)